================================================================================
do { STMT; }
================================================================================
do { 1; 2; };
do { 3; 4 };
--------------------------------------------------------------------------------

(source_file
  (expression_statement (do_expression
    (block
      (expression_statement (number))
      (expression_statement (number)))))
  (expression_statement (do_expression
    (block
      (expression_statement (number))
      (expression_statement (number))))))
================================================================================
Anonymous array
================================================================================
[ 1, 2 ];
--------------------------------------------------------------------------------

(source_file
  (expression_statement (anonymous_array_expression
    (list_expression (number) (number)))))
================================================================================
Anonymous hash
================================================================================
+{ 1, 2 };
--------------------------------------------------------------------------------

(source_file
  (expression_statement (unary_expression
    (anonymous_hash_expression
      (list_expression (number) (number))))))
================================================================================
Assignment
================================================================================
$var = 123;
$var = 12 + 34;
$var = 12, 34;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (assignment_expression (scalar) (number)))
  (expression_statement
    (assignment_expression (scalar) (binary_expression (number) (number))))
  (expression_statement
    (list_expression (assignment_expression (scalar) (number)) (number))))
================================================================================
Anonymous Slices
================================================================================
(1, 2, 3)[0];
qw/one two/[0];
--------------------------------------------------------------------------------
(source_file
  (expression_statement
    (anonymous_slice_expression list: (list_expression (number) (number) (number)) (number)))
  (expression_statement
    (anonymous_slice_expression list: (quoted_word_list) (number)))
    )
================================================================================
Slices
================================================================================
@ary[0,1];
@hash{qw/key1 key2/};
$aryref->@[0,1];
[0,1]->@[0];
$hashref->@{qw/key1 key2/};
--------------------------------------------------------------------------------
(source_file
  (expression_statement
    (slice_expression array: (slice_container_variable) (list_expression (number) (number))))
  (expression_statement
    (slice_expression hash: (slice_container_variable) (quoted_word_list)))
  (expression_statement
    (slice_expression arrayref: (scalar) (list_expression (number) (number))))
  (expression_statement
    (slice_expression
      arrayref: (anonymous_array_expression
        (list_expression (number) (number))
      )
      (number)))
  (expression_statement
    (slice_expression hashref: (scalar) (quoted_word_list)))
    )
================================================================================
Keyval Slices
================================================================================
%ary[0,1];
%hash{qw/key1 key2/};
$aryref->%[0,1];
[0,1]->%[0];
$hashref->%{qw/key1 key2/};
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (keyval_expression array: (keyval_container_variable) (list_expression (number) (number))))
  (expression_statement
    (keyval_expression hash: (keyval_container_variable) (quoted_word_list)))
  (expression_statement
    (keyval_expression arrayref: (scalar) (list_expression (number) (number))))
  (expression_statement
    (keyval_expression
      arrayref: (anonymous_array_expression
        (list_expression (number) (number))
      )
      (number)))
  (expression_statement
    (keyval_expression hashref: (scalar) (quoted_word_list)))
    )
================================================================================
Stub
================================================================================
();
--------------------------------------------------------------------------------

(source_file
  (expression_statement (stub_expression)))
================================================================================
Scalar deref
================================================================================
$$sref;
$sref->$*;
--------------------------------------------------------------------------------

(source_file
  (expression_statement (scalar (scalar)))
  (expression_statement (scalar_deref_expression (scalar))))
================================================================================
Array deref
================================================================================
@$aref;
$aref->@*;
--------------------------------------------------------------------------------

(source_file
  (expression_statement (array (scalar)))
  (expression_statement (array_deref_expression (scalar))))
================================================================================
Hash deref
================================================================================
%$href;
$href->%*;
--------------------------------------------------------------------------------

(source_file
  (expression_statement (hash (scalar)))
  (expression_statement (hash_deref_expression (scalar))))
================================================================================
Amper deref
================================================================================
$cref->&*;
--------------------------------------------------------------------------------

(source_file
  (expression_statement (amper_deref_expression (scalar))))
================================================================================
Glob deref
================================================================================
*$gref;
$gref->**;
--------------------------------------------------------------------------------

(source_file
  (expression_statement (glob (scalar)))
  (expression_statement (glob_deref_expression (scalar))))
================================================================================
require EXPR
================================================================================
require 123;
require;
--------------------------------------------------------------------------------

(source_file
  (expression_statement (require_expression (number)))
  (expression_statement (require_expression)))
================================================================================
Loopex
================================================================================
next;
last LOOP;
redo;
--------------------------------------------------------------------------------

(source_file
  (expression_statement (loopex_expression))
  (expression_statement (loopex_expression (label)))
  (expression_statement (loopex_expression)))
================================================================================
goto
================================================================================
goto LABEL;
--------------------------------------------------------------------------------

(source_file
  (expression_statement (goto_expression (label))))
================================================================================
undef
================================================================================
undef;
undef $var;
--------------------------------------------------------------------------------

(source_file
  (expression_statement (undef_expression))
  (expression_statement (undef_expression (scalar))))
================================================================================
local
================================================================================
local $var;
local $arr[$idx];
local $hash{$key};
local $SIG{INT} = sub { ... };
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (localization_expression (scalar)))
  (expression_statement
    (localization_expression (array_element_expression (container_variable) (scalar))))
  (expression_statement
    (localization_expression (hash_element_expression (container_variable) (scalar))))
  (expression_statement
    (assignment_expression
      (localization_expression (hash_element_expression (container_variable) (autoquoted_bareword)))
      (anonymous_subroutine_expression (block (expression_statement (yadayada)))))))
================================================================================
return
================================================================================
return;
return 1, 2, 3;
return 1, 2, 3 or die("never reached");
--------------------------------------------------------------------------------
(source_file
  (expression_statement (return_expression))
  (expression_statement (return_expression (number) (number) (number) ))
  (expression_statement
    (lowprec_logical_expression
      (return_expression (number) (number) (number) )
      (function_call_expression (function) (interpolated_string_literal))
    ))
)
