================================================================================
Function call (0 args)
================================================================================
foo();
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (function_call_expression (function))))
================================================================================
Function call (1 arg)
================================================================================
foo(123);
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (function_call_expression (function) (number))))
================================================================================
Function call (2 args)
================================================================================
foo(12, 34);
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (function_call_expression (function) (list_expression (number) (number)))))
================================================================================
Method call (no parens)
================================================================================
$obj->meth;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (method_call_expression
      invocant: (scalar)
      method:   (method))))
================================================================================
Method call (0 args)
================================================================================
$obj->meth();
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (method_call_expression
      invocant: (scalar)
      method:   (method))))
================================================================================
Method call (1 arg)
================================================================================
$obj->meth(123);
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (method_call_expression
      invocant:  (scalar)
      method:    (method)
      arguments: (number))))
================================================================================
Method call (2 args)
================================================================================
$obj->meth(12, 34);
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (method_call_expression
      invocant:  (scalar)
      method:    (method)
      arguments: (list_expression (number) (number)))))
================================================================================
Method call on class
================================================================================
Some::Module->new(1234);
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (method_call_expression
      invocant:  (bareword)
      method:    (method)
      arguments: (number))))
================================================================================
Func0 Ops
================================================================================
__FILE__;
wait;
time();
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (func0op_call_expression (func0op)))
  (expression_statement
    (func0op_call_expression (func0op)))
  (expression_statement
    (func0op_call_expression (func0op))))
================================================================================
Func1 Ops
================================================================================
defined $x;
int($num);
int;
int $x, int $y;
shift @arr;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (func1op_call_expression (func1op) (scalar)))
  (expression_statement
    (func1op_call_expression (func1op) (scalar)))
  (expression_statement
    (func1op_call_expression (func1op)))
  (expression_statement
    (list_expression
      (func1op_call_expression (func1op) (scalar))
      (func1op_call_expression (func1op) (scalar))))
  (expression_statement
    (func1op_call_expression (func1op) (array))))
