================================================================================
Fancy indirob interpolation
================================================================================
"${\$obj->method}";
"@{[1,2,3]}";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (scalar
        (block
          (expression_statement
            (refgen_expression
              (method_call_expression
                (scalar
                  (varname))
                (method))))))))
  (expression_statement
    (interpolated_string_literal
      (array
        (block
          (expression_statement
            (anonymous_array_expression
              (list_expression
                (number)
                (number)
                (number)))))))))

================================================================================
Array element interpolation
================================================================================
"an array $elem[0]";
"an array $elem->[1] deref";
"an deep $elem->[1][0] deref";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (array_element_expression
        (container_variable
          (varname))
        (number))))
  (expression_statement
    (interpolated_string_literal
      (array_element_expression
        (scalar
          (varname))
        (number))))
  (expression_statement
    (interpolated_string_literal
      (array_element_expression
        (array_element_expression
          (scalar
            (varname))
          (number))
        (number)))))

================================================================================
Hash element interpolation
================================================================================
"a $hash{key}";
"an $hash->{key} deref";
"an deep $hash->{key}{deref}";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (hash_element_expression
        (container_variable
          (varname))
        (autoquoted_bareword))))
  (expression_statement
    (interpolated_string_literal
      (hash_element_expression
        (scalar
          (varname))
        (autoquoted_bareword))))
  (expression_statement
    (interpolated_string_literal
      (hash_element_expression
        (hash_element_expression
          (scalar
            (varname))
          (autoquoted_bareword))
        (autoquoted_bareword)))))

================================================================================
Space skips interpolation
================================================================================
"an array $elem [0]";
"an array $elem ->[1] deref";
"an array $elem-> [1] deref";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (scalar
        (varname))))
  (expression_statement
    (interpolated_string_literal
      (scalar
        (varname))))
  (expression_statement
    (interpolated_string_literal
      (scalar
        (varname)))))

================================================================================
Slice interpolation
================================================================================
"a plain @ary[0,1]";
"a hash slice @hash{key}";
"and now postfix $aryref->@[0,1,2]";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (slice_expression
        array: (slice_container_variable
          (varname))
        (list_expression
          (number)
          (number)))))
  (expression_statement
    (interpolated_string_literal
      (slice_expression
        hash: (slice_container_variable
          (varname))
        (bareword))))
  (expression_statement
    (interpolated_string_literal
      (slice_expression
        arrayref: (scalar
          (varname))
        (list_expression
          (number)
          (number)
          (number))))))

================================================================================
Punctuation vars that interpolate
================================================================================
"$+";
"$(";
"$!";
"@+";
"@-";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (scalar
        (varname))))
  (expression_statement
    (interpolated_string_literal
      (scalar
        (varname))))
  (expression_statement
    (interpolated_string_literal
      (scalar
        (varname))))
  (expression_statement
    (interpolated_string_literal
      (array
        (varname))))
  (expression_statement
    (interpolated_string_literal
      (array
        (varname)))))

================================================================================
Punctuation vars that do not interpolate
================================================================================
"@(";
"@)";
"@";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal))
  (expression_statement
    (interpolated_string_literal))
  (expression_statement
    (interpolated_string_literal)))

================================================================================
braced vars do not subscript
================================================================================
"${herro}[not an index]";
"@{herro}[not an index]";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (scalar
        (varname))))
  (expression_statement
    (interpolated_string_literal
      (array
        (varname)))))

================================================================================
Nested quotes! (#98)
================================================================================
qq(things ${\q(and $shtuff)} and $shtuff);
s[things ${\q{hello}} ][ ${\q[hi again]}];
print "$test{'value'}";
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (interpolated_string_literal
      (scalar
        (block
          (expression_statement
            (refgen_expression
              (string_literal)))))
      (scalar
        (varname))))
  (expression_statement
    (substitution_regexp
      (regexp_content
        (scalar
          (block
            (expression_statement
              (refgen_expression
                (string_literal))))))
      (replacement
        (scalar
          (block
            (expression_statement
              (refgen_expression
                (string_literal))))))))
  (expression_statement
    (ambiguous_function_call_expression
      (function)
      (interpolated_string_literal
        (hash_element_expression
          (container_variable
            (varname))
          (string_literal))))))
