================================================================================
basic comment
================================================================================
# this is a comment
--------------------------------------------------------------------------------

(source_file
  (comment))

================================================================================
numeric parsing
================================================================================
111_111e99_99;
111_111e-99_99;
0xDEADBEEF;
0b11011011011;
077;
1234567890198;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (number))
  (expression_statement
    (number))
  (expression_statement
    (number))
  (expression_statement
    (number))
  (expression_statement
    (number))
  (expression_statement
    (number)))

================================================================================
maths! higher prec
================================================================================
2 * 4 ** 5;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (binary_expression
      left: (number)
      right: (binary_expression
        left: (number)
        right: (number)))))

================================================================================
maths: same prec - left assoc
================================================================================
3 x 5 % 2;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (binary_expression
      left: (binary_expression
        left: (number)
        right: (number))
      right: (number))))

================================================================================
unary prefixes!
================================================================================
!3;
~0;
~.0;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (unary_expression
      (number)))
  (expression_statement
    (unary_expression
      (number)))
  (expression_statement
    (unary_expression
      (number))))
