================================================================================
basic comment
================================================================================
# this is a comment
--------------------------------------------------------------------------------

(source_file
  (comment))

================================================================================
Multiple lines are a single comment group
================================================================================
# this is a comment
# split across
# multiple lines
--------------------------------------------------------------------------------

(source_file
  (comment)
  (comment)
  (comment))

================================================================================
data section - basic
================================================================================
1 + 1;
__DATA__
$this = not `code`
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (binary_expression
      (number)
      (number)))
  (eof_marker)
  (data_section))

================================================================================
data section - ctrl-d
================================================================================

$this = not `code`
--------------------------------------------------------------------------------

(source_file
  (eof_marker))

================================================================================
data section - ctrl-z
================================================================================
1 
$this = not `code`
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (number))
  (eof_marker))

================================================================================
data section anywhere
================================================================================
1 + 2 __END__ this is ignored too
$this = not `code`
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (binary_expression
      (number)
      (number)))
  (eof_marker)
  (data_section))

================================================================================
data section, but not in strings
================================================================================
'this is not a __DATA__ section'
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_literal)))

================================================================================
maths! higher prec
================================================================================
2 * 4 ** 5;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (binary_expression
      left: (number)
      right: (binary_expression
        left: (number)
        right: (number)))))

================================================================================
maths: same prec - left assoc
================================================================================
3 x 5 % 2;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (binary_expression
      left: (binary_expression
        left: (number)
        right: (number))
      right: (number))))

================================================================================
unary prefixes!
================================================================================
!3;
~0;
~.0;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (unary_expression
      (number)))
  (expression_statement
    (unary_expression
      (number)))
  (expression_statement
    (unary_expression
      (number))))

================================================================================
yadayada operator
================================================================================
...
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (yadayada)))

================================================================================
unicode whitespace
================================================================================
'several hair spaces'   ;
--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (string_literal)))
