================================================================================
expression as statement
================================================================================
123;
--------------------------------------------------------------------------------

(source_file
  (expression_statement (number)))
================================================================================
postfix if
================================================================================
123 if 45;
--------------------------------------------------------------------------------

(source_file
  (expression_statement (postfix_if_expression (number) (number))))
================================================================================
postfix unless
================================================================================
123 unless 45;
--------------------------------------------------------------------------------

(source_file
  (expression_statement (postfix_unless_expression (number) (number))))
================================================================================
postfix while
================================================================================
123 while 45;
--------------------------------------------------------------------------------

(source_file
  (expression_statement (postfix_while_expression (number) (number))))
================================================================================
postfix until
================================================================================
123 until 45;
--------------------------------------------------------------------------------

(source_file
  (expression_statement (postfix_until_expression (number) (number))))
================================================================================
postfix for
================================================================================
123 for 45;
123 foreach 45;
--------------------------------------------------------------------------------

(source_file
  (expression_statement (postfix_for_expression (number) (number)))
  (expression_statement (postfix_for_expression (number) (number))))
================================================================================
block if
================================================================================
if(1) { 123; }
--------------------------------------------------------------------------------

(source_file
  (if_statement (number)
    (block
      (expression_statement (number)))))
================================================================================
block if/else
================================================================================
if(1) { 123; } else { 456; }
--------------------------------------------------------------------------------

(source_file
  (if_statement (number)
    (block
      (expression_statement (number)))
    (else
      (block
        (expression_statement (number))))))
================================================================================
block if/elsif
================================================================================
if(1) { 123; } elsif(2) { 456; }
--------------------------------------------------------------------------------

(source_file
  (if_statement (number)
    (block
      (expression_statement (number)))
    (elsif (number)
      (block
        (expression_statement (number))))))
================================================================================
block if/elsif/else
================================================================================
if(1) { 123; } elsif(2) { 456; } else { 789; }
--------------------------------------------------------------------------------

(source_file
  (if_statement (number)
    (block
      (expression_statement (number)))
    (elsif (number)
      (block
        (expression_statement (number)))
      (else
        (block
          (expression_statement (number)))))))
================================================================================
block unless
================================================================================
unless(1) { 123; }
--------------------------------------------------------------------------------

(source_file
  (unless_statement (number)
    (block
      (expression_statement (number)))))
================================================================================
block while
================================================================================
while(1) { 123; }
--------------------------------------------------------------------------------

(source_file
  (while_statement (number)
    (block
      (expression_statement (number)))))
================================================================================
block until
================================================================================
until(1) { 123; }
--------------------------------------------------------------------------------

(source_file
  (until_statement (number)
    (block
      (expression_statement (number)))))
================================================================================
for (LIST) BLOCK
================================================================================
for (1) { 23; }
foreach (1) { 23; }
--------------------------------------------------------------------------------

(source_file
  (for_statement (number)
    (block (expression_statement (number))))
  (for_statement (number)
    (block (expression_statement (number)))))
================================================================================
for VAR (LIST) BLOCK
================================================================================
for $V (1) { 23; }
foreach $V (1) { 23; }
--------------------------------------------------------------------------------

(source_file
  (for_statement (scalar_var) (number)
    (block (expression_statement (number))))
  (for_statement (scalar_var) (number)
    (block (expression_statement (number)))))
================================================================================
for my VAR (LIST) BLOCK
================================================================================
for my $x (1) { 23; }
foreach my $x (1) { 23; }
--------------------------------------------------------------------------------

(source_file
  (for_statement (scalar_var) (number)
    (block (expression_statement (number))))
  (for_statement (scalar_var) (number)
    (block (expression_statement (number)))))
